package Homework2;

public class Task4 {
    /*
    Задание 4
Написать программу, которая выведет на консоль «Hello
world», не используя в исходном коде пробельных символов.
     */
    public static void main(String[] args) {
        System.out.println("Hello\u00A0world");
    }
}
