package Homework2;

public class Task3 {
    /*
Задание 3
В переменной n хранится вещественное число, с ненулевой дробной частью. Создайте программу, округляющую
число n до ближайшего целого и выводящую результат
округления на экран
     */
    public static void main(String[] args) {
        double num=18.75;
        System.out.println("Round number "+num+" to "+Math.round(num));
    }
}
